In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("edu_enrollees.csv")
df.head(2)

,enrollee_id,city,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,Xgrp
0,8949.0,city_103,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36.0,1.0,train
1,29725.0,city_40,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47.0,0.0,train

In [3]:
df.columns

Index(['enrollee_id', 'city', 'city_development_index', 'gender',
       'relevant_experience', 'enrolled_university', 'education_level',
       'major_discipline', 'experience', 'company_size', 'company_type',
       'last_new_job', 'training_hours', 'target', 'Xgrp'],
      dtype='object')

In [4]:
df_base = df[['enrollee_id', 'city_development_index', 'gender', 'relevant_experience', 'enrolled_university', 'education_level', 'major_discipline', 'experience','last_new_job', 'training_hours', 'target', 'Xgrp']]
df_base.head(2)

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
0,8949.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,1,36.0,1.0,train
1,29725.0,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,47.0,0.0,train

In [5]:
df_base.shape

(19158, 12)

In [6]:
df_base.head(10)

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
0,8949.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,1,36.0,1.0,train
1,29725.0,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,47.0,0.0,train
2,11561.0,0.624,NaN,No relevant experience,Full time course,Graduate,STEM,5,never,83.0,0.0,train
3,33241.0,0.789,NaN,No relevant experience,NaN,Graduate,Business Degree,<1,never,52.0,1.0,train
4,666.0,0.767,Male,Has relevant experience,no_enrollment,Masters,STEM,>20,4,8.0,0.0,train
5,21651.0,0.764,NaN,Has relevant experience,Part time course,Graduate,STEM,11,1,24.0,1.0,train
6,28806.0,0.920,Male,Has relevant experience,no_enrollment,High School,NaN,5,1,24.0,0.0,train
7,402.0,0.762,Male,Has relevant experience,no_enrollment,Graduate,STEM,13,>4,18.0,1.0,train
8,27107.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,7,1,46.0,1.0,train
9,699.0,0.920,NaN,Has relevant experience,no_enrollment,Graduate,STEM,17,>4,123.0,0.0,train

In [7]:
df_base = df_base.dropna()

In [8]:
df_base.head(10)

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
0,8949.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,1,36.0,1.0,train
1,29725.0,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,47.0,0.0,train
4,666.0,0.767,Male,Has relevant experience,no_enrollment,Masters,STEM,>20,4,8.0,0.0,train
7,402.0,0.762,Male,Has relevant experience,no_enrollment,Graduate,STEM,13,>4,18.0,1.0,train
8,27107.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,7,1,46.0,1.0,train
11,23853.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,5,1,108.0,0.0,train
12,25619.0,0.913,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,3,23.0,0.0,train
15,6588.0,0.926,Male,Has relevant experience,no_enrollment,Graduate,STEM,16,>4,18.0,0.0,train
19,11399.0,0.827,Female,Has relevant experience,no_enrollment,Graduate,Arts,4,1,132.0,1.0,train
20,31972.0,0.843,Male,Has relevant experience,no_enrollment,Masters,STEM,11,1,68.0,0.0,train

In [9]:
df_base.shape

(12477, 12)

In [10]:
df_base.dtypes

enrollee_id               float64
city_development_index    float64
gender                     object
relevant_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                 object
last_new_job               object
training_hours            float64
target                    float64
Xgrp                       object
dtype: object

In [13]:
df_base = df_base.loc[~df_base["experience"].str.contains(">20"), ]
df_base.head()

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
1,29725.0,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,47.0,0.0,train
7,402.0,0.762,Male,Has relevant experience,no_enrollment,Graduate,STEM,13,>4,18.0,1.0,train
8,27107.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,7,1,46.0,1.0,train
11,23853.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,5,1,108.0,0.0,train
15,6588.0,0.926,Male,Has relevant experience,no_enrollment,Graduate,STEM,16,>4,18.0,0.0,train

In [14]:
df_base["experience"].unique()

array(['15', '13', '7', '5', '16', '4', '11', '<1', '18', '19', '12',
       '10', '9', '2', '6', '14', '3', '8', '20', '17', '1'], dtype=object)

In [15]:
df_base = df_base.loc[~df_base["experience"].str.contains("<1"), ]
df_base.head()

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
1,29725.0,0.776,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,47.0,0.0,train
7,402.0,0.762,Male,Has relevant experience,no_enrollment,Graduate,STEM,13,>4,18.0,1.0,train
8,27107.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,7,1,46.0,1.0,train
11,23853.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,5,1,108.0,0.0,train
15,6588.0,0.926,Male,Has relevant experience,no_enrollment,Graduate,STEM,16,>4,18.0,0.0,train

In [16]:
df_base["experience"].unique()

array(['15', '13', '7', '5', '16', '4', '11', '18', '19', '12', '10', '9',
       '2', '6', '14', '3', '8', '20', '17', '1'], dtype=object)

In [19]:
df_base["experience"] = df_base["experience"].astype("int")

In [20]:
df_base.dtypes

enrollee_id               float64
city_development_index    float64
gender                     object
relevant_experience        object
enrolled_university        object
education_level            object
major_discipline           object
experience                  int32
last_new_job               object
training_hours            float64
target                    float64
Xgrp                       object
dtype: object

In [21]:
df_base = df_base.loc[~df_base["last_new_job"].str.contains(">4"), ]
df_base = df_base.loc[~df_base["last_new_job"].str.contains("never"), ]
df_base.head()

,enrollee_id,city_development_index,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target,Xgrp
8,27107.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,7,1,46.0,1.0,train
11,23853.0,0.920,Male,Has relevant experience,no_enrollment,Graduate,STEM,5,1,108.0,0.0,train
19,11399.0,0.827,Female,Has relevant experience,no_enrollment,Graduate,Arts,4,1,132.0,1.0,train
20,31972.0,0.843,Male,Has relevant experience,no_enrollment,Masters,STEM,11,1,68.0,0.0,train
21,19061.0,0.926,Male,Has relevant experience,no_enrollment,Masters,STEM,11,2,50.0,0.0,train

In [22]:
df_base["last_new_job"] = df_base["last_new_job"].astype("int")

In [23]:
df_base.shape

(7522, 12)

In [24]:
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier

In [28]:
df_base.loc[df_base["relevant_experience"] == "No relevant experience", ].shape

(1413, 12)

In [29]:
df_base.loc[(df_base["relevant_experience"] == "No relevant experience") & (df_base["target"] == 1.0), ].shape

(541, 12)

In [30]:
df_base.loc[df_base["relevant_experience"] == "Has relevant experience", ].shape

(6109, 12)

In [31]:
df_base.loc[(df_base["relevant_experience"] == "Has relevant experience") & (df_base["target"] == 1.0), ].shape

(1319, 12)

In [32]:
round((541/1413) / (1319/6109), 2)

1.77

In [33]:
df_base_q2 = pd.get_dummies(df_base, drop_first=)
df_base_q2.head(10)

,enrollee_id,city_development_index,experience,last_new_job,training_hours,target,gender_Male,gender_Other,relevant_experience_No relevant experience,enrolled_university_Part time course,enrolled_university_no_enrollment,education_level_Masters,education_level_Phd,major_discipline_Business Degree,major_discipline_Humanities,major_discipline_No Major,major_discipline_Other,major_discipline_STEM,Xgrp_train
8,27107.0,0.920,7,1,46.0,1.0,1,0,0,0,1,0,0,0,0,0,0,1,1
11,23853.0,0.920,5,1,108.0,0.0,1,0,0,0,1,0,0,0,0,0,0,1,1
19,11399.0,0.827,4,1,132.0,1.0,0,0,0,0,1,0,0,0,0,0,0,0,1
20,31972.0,0.843,11,1,68.0,0.0,1,0,0,0,1,1,0,0,0,0,0,1,1
21,19061.0,0.926,11,2,50.0,0.0,1,0,0,0,1,1,0,0,0,0,0,1,1
27,28476.0,0.920,5,2,72.0,0.0,1,0,0,0,1,0,0,0,0,0,0,0,1
29,10408.0,0.624,18,2,68.0,1.0,1,0,0,0,1,0,0,0,0,0,0,1,1
32,4324.0,0.920,5,1,24.0,0.0,0,0,1,0,0,0,0,0,0,0,0,1,1
34,26494.0,0.910,12,3,145.0,0.0,1,0,0,0,1,0,0,1,0,0,0,0,1
35,4866.0,0.920,10,2,206.0,0.0,1,0,0,0,1,0,0,0,0,0,0,1,1

In [34]:
model = LogisticRegression(random_state=123, C=100000, max_iter=1000, solver="liblinear")

In [ ]:
model.fit(X = job2)

##

In [35]:
df = df.drop(columns = ["city", "company_size", "company_type"])
df.isna().sum()

enrollee_id                  0
city_development_index       0
gender                    4508
relevant_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
last_new_job               423
training_hours               0
target                       0
Xgrp                         0
dtype: int64

In [36]:
df_str = df.select_dtypes(exclude="number")
df_str.dtypes

gender                 object
relevant_experience    object
enrolled_university    object
education_level        object
major_discipline       object
experience             object
last_new_job           object
Xgrp                   object
dtype: object

In [37]:
df_str.head(2)

,gender,relevant_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,Xgrp
0,Male,Has relevant experience,no_enrollment,Graduate,STEM,>20,1,train
1,Male,No relevant experience,no_enrollment,Graduate,STEM,15,>4,train

In [38]:
df_str.isna().sum()

gender                 4508
relevant_experience       0
enrolled_university     386
education_level         460
major_discipline       2813
experience               65
last_new_job            423
Xgrp                      0
dtype: int64

In [39]:
df_num = df.select_dtypes(include = "number")
df_num.isna().sum()

enrollee_id               0
city_development_index    0
training_hours            0
target                    0
dtype: int64

In [40]:
df = df.dropna()
len(df)

12477

In [42]:
df = df.loc[~df["experience"].isin([">20", "<1"]),]
df = df.loc[~df["last_new_job"].isin([">4", "never"]),]

In [43]:
df["experience"] = df["experience"].astype("int")
df["last_new_job"] = df["last_new_job"].astype("int")

In [44]:
len(df)

7522

In [45]:
df_base = df.copy()

## Q1.

In [46]:
df_base["relevant_experience"].unique()

array(['Has relevant experience', 'No relevant experience'], dtype=object)

In [47]:
df_q1_no = df_base.loc[df_base["relevant_experience"] == "No relevant experience", ]
df_q1_has = df_base.loc[df_base["relevant_experience"] != "No relevant experience", ]

In [48]:
df_q1_no["target"].value_counts()

0.0    872
1.0    541
Name: target, dtype: int64

In [49]:
df_q1_no["target"].value_counts(normalize=True)

0.0    0.617127
1.0    0.382873
Name: target, dtype: float64

In [50]:
df_q1_has["target"].value_counts(normalize=True)

0.0    0.784089
1.0    0.215911
Name: target, dtype: float64

In [52]:
stat_1 = df_q1_no["target"].value_counts(normalize=True)[1]
stat_2 = df_q1_has["target"].value_counts(normalize=True)[1]
round(stat_1 / stat_2, 2)

1.77

In [55]:
pd.crosstab(df_base["relevant_experience"], df_base["target"], normalize="index")

target                        0.0       1.0
relevant_experience
Has relevant experience  0.784089  0.215911
No relevant experience   0.617127  0.382873

In [54]:
df_base.groupby("relevant_experience")["target"].mean()

relevant_experience
Has relevant experience    0.215911
No relevant experience     0.382873
Name: target, dtype: float64

## Q2.

In [60]:
df_base = df_base.reset_index(drop=True)

In [61]:
df_q2_cat = df_base[["gender", "relevant_experience", "enrolled_university", "education_level", "major_discipline"]]
df_q2_cat.head(2)

,gender,relevant_experience,enrolled_university,education_level,major_discipline
0,Male,Has relevant experience,no_enrollment,Graduate,STEM
1,Male,Has relevant experience,no_enrollment,Graduate,STEM

In [62]:
df_q2_cat_dum = pd.get_dummies(df_q2_cat)
df_q2_cat_dum.head(2)

,gender_Female,gender_Male,gender_Other,relevant_experience_Has relevant experience,relevant_experience_No relevant experience,enrolled_university_Full time course,enrolled_university_Part time course,enrolled_university_no_enrollment,education_level_Graduate,education_level_Masters,education_level_Phd,major_discipline_Arts,major_discipline_Business Degree,major_discipline_Humanities,major_discipline_No Major,major_discipline_Other,major_discipline_STEM
0,0,1,0,1,0,0,0,1,1,0,0,0,0,0,0,0,1
1,0,1,0,1,0,0,0,1,1,0,0,0,0,0,0,0,1

In [63]:
drop_cols = ["gender_Other", "relevant_experience_No relevant experience", "enrolled_university_no_enrollment", "education_level_Phd", "major_discipline_STEM"]
df_q2_cat_dum = df_q2_cat_dum.drop(columns=drop_cols)

In [64]:
df_q2_cat_dum.columns

Index(['gender_Female', 'gender_Male',
       'relevant_experience_Has relevant experience',
       'enrolled_university_Full time course',
       'enrolled_university_Part time course', 'education_level_Graduate',
       'education_level_Masters', 'major_discipline_Arts',
       'major_discipline_Business Degree', 'major_discipline_Humanities',
       'major_discipline_No Major', 'major_discipline_Other'],
      dtype='object')

In [66]:
df_q2 = df_base[["target", "Xgrp", "city_development_index", "experience", "last_new_job", "training_hours"]]
df_q2 = pd.concat([df_q2, df_q2_cat_dum], axis = 1).copy()
df_q2.head(2)

,target,Xgrp,city_development_index,experience,last_new_job,training_hours,gender_Female,gender_Male,relevant_experience_Has relevant experience,enrolled_university_Full time course,enrolled_university_Part time course,education_level_Graduate,education_level_Masters,major_discipline_Arts,major_discipline_Business Degree,major_discipline_Humanities,major_discipline_No Major,major_discipline_Other
0,1.0,train,0.92,7,1,46.0,0,1,1,0,0,1,0,0,0,0,0,0
1,0.0,train,0.92,5,1,108.0,0,1,1,0,0,1,0,0,0,0,0,0

In [67]:
df_job2 = df_q2.copy()

In [68]:
df_job2.shape[1]

18

In [70]:
model_lr = LogisticRegression(random_state=123, C=100000, max_iter=1000, solver="liblinear")
model_lr.fit(X = df_job2.drop(columns=["target", "Xgrp"]), 
            y = df_job2["target"])

LogisticRegression(C=100000, max_iter=1000, random_state=123,
                   solver='liblinear')

In [71]:
model_lr.coef_

array([[-6.13150412e+00, -2.81691230e-02,  9.57803375e-02,
        -9.23704557e-04, -1.51500286e-01, -1.12275190e-01,
        -7.65620657e-01,  5.15864255e-01, -2.76402260e-01,
         3.53035498e-01,  4.83728703e-02,  3.10439212e-01,
         1.23016826e-01,  2.65788411e-01,  4.22318992e-01,
        -4.34692489e-01]])

In [72]:
import numpy as np

In [74]:
np.exp(model_lr.coef_).max()

1.6750855768802067

In [75]:
pd.DataFrame(model_lr.coef_, 
            columns=df_job2.columns[2:]).transpose()

                                                    0
city_development_index                      -6.131504
experience                                  -0.028169
last_new_job                                 0.095780
training_hours                              -0.000924
gender_Female                               -0.151500
gender_Male                                 -0.112275
relevant_experience_Has relevant experience -0.765621
enrolled_university_Full time course         0.515864
enrolled_university_Part time course        -0.276402
education_level_Graduate                     0.353035
education_level_Masters                      0.048373
major_discipline_Arts                        0.310439
major_discipline_Business Degree             0.123017
major_discipline_Humanities                  0.265788
major_discipline_No Major                    0.422319
major_discipline_Other                      -0.434692

## Q3.

In [76]:
df_train = df_job2.loc[df_job2["Xgrp"] == "train", ].drop(columns="Xgrp")
df_test = df_job2.loc[df_job2["Xgrp"] == "test", ].drop(columns="Xgrp")

In [77]:
df_train.head(2)

,target,city_development_index,experience,last_new_job,training_hours,gender_Female,gender_Male,relevant_experience_Has relevant experience,enrolled_university_Full time course,enrolled_university_Part time course,education_level_Graduate,education_level_Masters,major_discipline_Arts,major_discipline_Business Degree,major_discipline_Humanities,major_discipline_No Major,major_discipline_Other
0,1.0,0.92,7,1,46.0,0,1,1,0,0,1,0,0,0,0,0,0
1,0.0,0.92,5,1,108.0,0,1,1,0,0,1,0,0,0,0,0,0

In [78]:
model_knn= KNeighborsClassifier(n_neighbors=5)
model_knn.fit(X = df_train.drop(columns="target"), 
             y = df_train["target"])
pred = model_knn.predict(df_test.drop(columns="target"))
pred[:4]

array([0., 0., 0., 0.])

In [79]:
df_pair = pd.DataFrame(dict(true = df_test["target"], pred = pred))
df_pair.head()

      true  pred
4706   0.0   0.0
4707   1.0   0.0
4708   0.0   0.0
4709   0.0   0.0
4710   0.0   0.0

In [80]:
pd.crosstab(df_test["target"], pred)

col_0    0.0  1.0
target
0.0     1897  195
1.0      616  108

In [81]:
from sklearn.metrics import accuracy_score

In [82]:
round(accuracy_score(y_true = df_test["target"], 
                     y_pred = pred), 2)

0.71